# Introduzione a Pandas

## 1. Oggetti

Nella libreria `pandas` possiamo utilizzare principalmente tre oggetti diversi, collegati fra loro.

- `Series`: una sorta di lista potenziata. Lo si puo pensare come una colonna di una DB. Una feauture interessante e quella dell'indice, che permette di assegnare ad ogni valore della `Series` un indice specifico, che puo anche essere definito dall'utente. 
- `DataFrame`: un dizionario di `Series`, dove i valori sono allineati per riga. Questo oggetto e il piu versatile della libreria ed anche quello che la rende cosi potente e di vasto utilizzo. 
- `Index`: l'oggetto che gestisce dati e metadati (nomi...) relativi agli assi di `DataFrame` e `Series`

Con questi tre oggetti e possibile effettuare un insieme enorme di compiti di data analisi. Se correttamente utilizzati, permettono di gestire grandi qunatita di dati in maniera veloce e semplice, tramite un'API intuitiva. In qualche si puo immaginare come una versione piu potente di Excel senza interfaccia grafica.

In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### Series

Una `Series` puo essere inizializzati in modi diversi.

In [4]:
# Series
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
# Series index
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4,7,5,-3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a    5
c   -3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
sdata = {'Ohio' : 35000, 'Texas' : 71000, 'Oregon' : 16000, 'Utah' : 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [9]:
obj3.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [10]:
# selecting interesting data in the original dictionary by specifying the index
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

L'accesso ad i dati presenti in una `Series` puo avvenire sia in maniera simili agli `array` di *numpy*, che tramite l'indice.

In [11]:
# access to a specific element by index position
obj2['a']

np.int64(5)

In [12]:
# bare slice 
obj2[:]

d    4
b    7
a    5
c   -3
dtype: int64

In [13]:
# access to multiple values
obj2[['a', 'b', 'd']]

a    5
b    7
d    4
dtype: int64

In [14]:
obj2[2:4]

a    5
c   -3
dtype: int64

In [15]:
# filtering
obj2[obj2>0]

d    4
b    7
a    5
dtype: int64

Le operazioni sulle `Series` avvengono in maniera simili agli `array` di *numpy*. Una *feature* molto utile e quella dell'allineamento automatico per indice nel caso di operazioni fra `Series`.

In [16]:
# element-wise operations
obj2*2

d     8
b    14
a    10
c    -6
dtype: int64

In [17]:
print(
    f'obj3:\n {obj3} \n'
    f'\nobj4:\n {obj4} \n'
    f'\nobj3 + obj4:\n {obj3+obj4}'
)

obj3:
 Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

obj4:
 California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

obj3 + obj4:
 California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Esistono anche dei metodi molto comodi che permettono di identificare i valori nulli (`NaN`) all'interno della `Series`.

In [18]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
# filtering out NaN values
obj4[pd.notna(obj4)]

Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

Ad una `Series` e possibile: 
1. Modificare l'indice, 
2. Dare un nome, sia alla `Series` che al suo indice.

In [ ]:
# name
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [43]:
# index in-place alteration
obj.index = pd.Index(['Tizio', 'Caio', 'Sempronio', 'Cesare'])
obj

Tizio        4
Caio         7
Sempronio   -5
Cesare       3
dtype: int64

### DataFrame

Come per le `Series`, esistono modi diversi di inizializzare un `DataFrame`.

In [24]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year' : [2000, 2001, 2002, 2001, 2002, 2003],
    'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
        }

frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [25]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [26]:
# fancy initialization: check what's strange here!
frame_iter = DataFrame(
    {key : value for key, value in zip(np.arange(10), np.random.standard_normal(10))},
    index = pd.Index([1,2,3])
)
frame_iter

,0,1,2,3,4,5,6,7,8,9
1,0.42116,0.416443,2.277997,0.91692,0.543233,-1.051378,-0.39367,-2.071778,1.248526,1.326067
2,0.42116,0.416443,2.277997,0.91692,0.543233,-1.051378,-0.39367,-2.071778,1.248526,1.326067
3,0.42116,0.416443,2.277997,0.91692,0.543233,-1.051378,-0.39367,-2.071778,1.248526,1.326067

In [27]:
# nested dictionary of dictionaries 
populations = {
    'Ohio' : {2000 : 1.5, 2001 : 1.7, 2002 : 3.6},
    'Nevada' : {2001 : 2.4, 2002:2.9}
}

# keys in the inner dictionaries are combined unless a specific index is defined
frame3 = DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [ ]:
# transposing a DataFrame
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [29]:
DataFrame(populations, index = [2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

Per `DataFrame` molto grandi esistono due metodi che permettono di accedere solamente alle prime o ultime 5 righe del dataset.

In [45]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [31]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Per accedere ai dati nel `DataFrame` e possibile utilizzare direttamente il nome delle colonne oppure dei metodi specifici.

In [32]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [ ]:
frame2.year

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [34]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [35]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [36]:
frame2['debt'] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [37]:
frame2['debt'] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [38]:
# creating a new column
frame2['eastern'] = frame2['state'] == 'Ohio'
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   0.0     True
1  2001    Ohio  1.7   1.0     True
2  2002    Ohio  3.6   2.0     True
3  2001  Nevada  2.4   3.0    False
4  2002  Nevada  2.9   4.0    False
5  2003  Nevada  3.2   5.0    False

In [39]:
# deleting columns
del frame2['eastern']
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

Come per le `Series` e possibile dare un nome sia alle righe che alle colonne di un `DataFrame`.

In [40]:
# naming rows
frame3.index.name = 'year'

# naming cols
frame3.columns.name = 'State'

frame3

State  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

E possibile convertire un `DataFrame` ad un `array` di *numpy* con un apposito metodo.

In [41]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, 0.0],
       [2001, 'Ohio', 1.7, 1.0],
       [2002, 'Ohio', 3.6, 2.0],
       [2001, 'Nevada', 2.4, 3.0],
       [2002, 'Nevada', 2.9, 4.0],
       [2003, 'Nevada', 3.2, 5.0]], dtype=object)

## 2. Funzioni Fondamentali di Pandas

*pandas* e una libreria molto ampia e permette di processare i dati in molto modi differenti. Tuttavia ci sono delle funzioni fondamentali che sono fondamentali:
1. **Processazione e modifica** dei dati
   1. Ri-indicizzazione
   2. Cancellazione di entrate
   3. Gestione degli assi nel caso di etichetta duplicata
2. **Accesso** ai dati: indicizzazione, selezione, filtraggio
3. **Operazioni** sui dati: 
   1. Operazioni binarie ed allineamento dei dati 
   2. Applicazione di funzioni e mappe
   3. *Sorting* e *Ranking*

### Processazione e modifica dei dati

#### **Reindexing**
Si intende la creazione di un nuovo oggetto che riorganizza i dati in accordo ad un nuovo indice. Quest'operazione permette di visualizzare i dati in un ordine preferito dall'utente.

In [69]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [72]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

Il metodo `reindex` permette di imputare i dati mancanti specificando un `method`.

In [73]:
obj3 = Series(['blue', 'purple', 'yellow'], index = [0,2,4])
obj3.reindex(np.arange(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [74]:
frame = DataFrame(np.arange(9).reshape((3,3)),
                  index = ['a', 'c', 'd'],
                  columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [77]:
frame2 = frame.reindex(index = ['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [80]:
states = ['Texas', 'Utah', 'California']
frame2.reindex(columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [81]:
# the modification is temporary 
frame2.reindex(columns=states)
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [82]:
# look what happens in case of reindexing with a completely different index
frame2.reindex(index=[1,2,3])

   Ohio  Texas  California
1   NaN    NaN         NaN
2   NaN    NaN         NaN
3   NaN    NaN         NaN

Il metodo `reindex` permette di gestire i dati in molti modi diversi. Per una guida completa al suo utilizzo si rimanda alla relativa [documentazione](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.reindex.html).

#### Cancellazione di Entrate

La rimozione di una o piu entrata di un `DataFrame` o `Series` e un'operazione piuttosto semplice.

In [83]:
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [84]:
new_obj = obj.drop('e')
new_obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [85]:
new_obj = new_obj.drop(['c', 'd'])
new_obj

a    0.0
b    1.0
dtype: float64

Nel caso dei `DataFrame` e possibile rimuovere valori da entrambi gli assi (righe, colonne).

In [86]:
data = DataFrame(
    np.arange(16).reshape((4,4)),
    index =['Ohio', 'Colorado', 'Utah', 'New York'], # rows names
    columns = ['one', 'two', 'three', 'four']
                 )

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [87]:
data.drop(index=['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [88]:
data.drop(columns=['one', 'two'])

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [ ]:
# these statements are equivalent
data.drop('two', axis = 1)
data.drop('two', axis = 'columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [90]:
data.drop('Colorado', axis = 'index')

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

#### Gestione degli assi nel caso di etichetta duplicata

Nonostante molti metodi - ad esempio `.reindex()` - richiedano che gli assi abbiano un'etichetta univoca, questa condizione non e obbligatoria per la creazione di una `Series` o di un `DataFrame`.

In [91]:
obj = Series(np.arange(5), index = ['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [ ]:
# attribute of the Series
obj.index.is_unique

False

In [93]:
obj['a']

a    0
a    1
dtype: int64

In [94]:
df = DataFrame(np.random.standard_normal((5,3)), index = ['a', 'a', 'b', 'b', 'c'])
df

          0         1         2
a  2.148090 -0.277400  0.797229
a  0.064832  0.998565 -1.442816
b  0.382154  0.864992 -1.009539
b  0.877136 -0.829397 -0.608195
c  1.043493  0.876083  1.066306

In [95]:
df.loc['b']

          0         1         2
b  0.382154  0.864992 -1.009539
b  0.877136 -0.829397 -0.608195

In [96]:
df.index.is_unique

False

### Accesso ai Dati

L'accesso ai dati presenti in una `Series` o in un `DataFrame` avviene in maniera simile a quanto si poteva fare con gli `array` di *numpy*. Nel caso degli oggetti di *pandas* e possibile accedere ai dati anche specificando i valori dell'indice associato all'oggetto.

Trattiamo prima l'accesso alle `Series`.

In [97]:
obj = Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [98]:
obj['b']

np.float64(1.0)

In [ ]:
# positional access
obj[1]

/tmp/ipykernel_10223/2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

np.float64(1.0)

In [ ]:
# [] access generates confusion in caso of numeral index
obj.index = pd.Index([0,2,1,3])
obj

0    0.0
2    1.0
1    2.0
3    3.0
dtype: float64

In [ ]:
# access through index
obj[1]

np.float64(2.0)

Si preferisce utilizzare un apposito operatore `loc` per accedere ai dati invece del classico `[]`. 

Questa e una pratica comune poiche non di rado il nostro indice potrebbe contenere numerali. Utilizzando l'operatore `[]` so puo creare confusione nei dati selezionati. Infatti la selezione dipende dal tipo di valore dato in input a `[]`. I numerali vengono trattati come valori di un indice nel caso di indice numerale, mentre come valori posizionali in ogni altro caso. 

L'operatore `loc`, invece, fa **sempre** riferimento ai valori presenti nell'indice. Per questo motivo si preferisce questo rispetto all'accesso classico con le parentesi quadre.

In [ ]:
# access through index
obj.loc[1]

np.float64(2.0)

L'operatore `iloc` permette invece di lavorare **sempre** per accesso posizionale con gli interi, **indipendentemente** dai valori presenti nell'indice.

In [ ]:
# access through position 
obj.iloc[[1,2]] # type: ignore

1    a
2    d
dtype: object

> Differenza fra `loc` e `iloc`
> - `loc`: accesso tramite **indice** ai dati 
> - `iloc`: accesso **posizionale** ai dati

Parliamo adesso dell'accesso ai `DataFrame`

L'operatore `[]` accede ai dati per **colonna**, con qualche utilizzo di convenienza particolare.

In [111]:
data = DataFrame(
    np.arange(16).reshape((4,4)),
    index = ['Ohio', 'Colorado', 'Utah', 'New York'],
    columns = ['one', 'two', 'three', 'four']
)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [114]:
data[['two', 'four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [115]:
# slicing
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [116]:
# boolean filtering 
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
# boolean filtering with a mask
mask = data < 5
data[mask] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [119]:
mask

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

Gli operatori `loc` ed `iloc` funzionano esattamente come nel caso delle `Series`, con la differenza che nei `DataFrame` e possibile accedere ai dati da dua assi differenti. Per il resto, come prima: 
- `loc`: accesso per indice
- `iloc`: accesso posizionale

In [120]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
# index access
data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [122]:
data.loc[['Colorado', 'New York']]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [ ]:
# combined row-columns access
data.loc[['Colorado', 'New York'], ['two', 'three']]

          two  three
Colorado    5      6
New York   13     14

In [130]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [131]:
data.loc[:,:]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
# filtering
data.loc[data.three >= 2] = 2 
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    2    2      2     2
Utah        2    2      2     2
New York    2    2      2     2

In [148]:
data.loc[data.three == 0, ['four','three']]

      four  three
Ohio     0      0

In [138]:
# positional row-columns access
data.iloc[[0,2], [2,3]]

      three  four
Ohio      0     0
Utah      2     2

In [132]:
# filtering 
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Operazioni sui dati

#### Operazioni binarie ed allineamento dei dati

Le operazioni fra oggetti in *pandas*, vengono gestite allineando gli indici degli operandi. Come regola generale, l'oggetto risultante avra:
1. come **assi**, l'unione degli assi degli operandi,
2. come **valori**:
   - il risultato dell'operazione, quando il relativo valore dell'indice si trova in **entrambi** gli oggetti,
   - `NaN`, altrimenti.

In [150]:
s1 = pd.Series(
    [7.3, -2.5, 3.4, 1.5],
    index = list('acde')
)

s2 = pd.Series(
    [-2.1, 3.6, -1.5, 4, 3.1],
    index = ['a', 'c', 'e', 'f', 'g']
)

In [151]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [152]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [154]:
s = s1+s2
s

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [155]:
s[pd.isna(s)]

d   NaN
f   NaN
g   NaN
dtype: float64

In [161]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns = list('bdc'), index = ['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
df = df1 + df2
df

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   5.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  11.0 NaN
Utah      NaN NaN   NaN NaN

In [177]:
df1

            b    d    c
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [178]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Visto che in generale il valore `NaN` e piuttosto scomodo da gestire, e possibile definire un valore di rimpiazzo al suo posto nel caso in cui ce ne sia bisogno. Per fare questo e necessario utilizzare appositi operatori binari presenti nell'API di Pandas.

In [184]:
df1 = DataFrame(
    np.arange(12.).reshape((3,4)), 
    columns = list('abcd')
)

df2 = DataFrame(
    np.arange(20.).reshape((4,5)), 
    columns = list('abcde')
)

df2.loc[1, 'b'] = np.nan

df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [186]:
# padding with 0 instead of NaN
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Per una lista completa delle operazioni che possono essere effettuate in questo modo fra `DataFrame` si rimanda alla [documentazione](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html).

#### Applicazione di Funzioni e Mappe

E possibile applicare una funzione oppure una mappa ad i valori presenti in un `DataFrame` od una `Series` in maniera piuttosto semplice. Esistono sia funzioni *universali*, come succedeva in *numpy*, che operatori come `.apply()`.

In [190]:
np.random.seed(42)
frame = DataFrame(
    np.random.standard_normal((4,3)),
    columns = list('bde'),
    index = list('abcd')
)
frame

          b         d         e
a  0.496714 -0.138264  0.647689
b  1.523030 -0.234153 -0.234137
c  1.579213  0.767435 -0.469474
d  0.542560 -0.463418 -0.465730

In [191]:
# ufunc
np.abs(frame)

          b         d         e
a  0.496714  0.138264  0.647689
b  1.523030  0.234153  0.234137
c  1.579213  0.767435  0.469474
d  0.542560  0.463418  0.465730

In [ ]:
# function definition 
def f1(x):
    return x.max() - x.min()

# function application (by column)
frame.apply(f1)

b    1.082499
d    1.230852
e    1.117163
dtype: float64

In [ ]:
# function application (by row)
frame.apply(f1, axis = 'columns')

a    0.785953
b    1.757183
c    2.048687
d    1.008290
dtype: float64

Nel caso di `apply` il valore `axis` deve essere interpretato come la dimensione che viene *scorsa* durante l'operazione.

In [ ]:
# map operation 
def my_format(x):
    return f'{x:.2f}'

# map application
frame.map(my_format)

      b      d      e
a  0.50  -0.14   0.65
b  1.52  -0.23  -0.23
c  1.58   0.77  -0.47
d  0.54  -0.46  -0.47

> **Differenza** fra mappa e funzione
> 
> Per *mappa* si intende un'operazione applicata a **tutti i dati** dell'oggetto. Ad esempio, le funzioni universali di *numpy* sono mappe
> Per *funzione* si intende un'operazione che viene applicata lungo **uno** degli assi dell'oggetto.

#### Sorting e Ranking

> **Sorting**
>
> Riordinare gli assi dell'oggetto oppure i valori al suo interno in ordine ascendente o discendente con criterio lessicografico.

In [ ]:
# sorting a Series
obj

0    0.0
2    1.0
1    2.0
3    3.0
dtype: float64

In [ ]:
# by index
obj.sort_index()

0    0.0
1    2.0
2    1.0
3    3.0
dtype: float64

In [ ]:
# by value
obj.sort_values()

0    0.0
2    1.0
1    2.0
3    3.0
dtype: float64

Un `DataFrame` puo essere ordinato sia per i valori degli assi (righe, colonne) che per i valori dei dati al suo interno.

In [206]:
# sorting a DataFrame
df

            b    c     d     e
Colorado  6.0  8.0   7.0   NaN
Ohio      3.0  2.0   5.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  5.0  11.0   8.0
Utah      0.0  NaN   1.0   2.0

In [ ]:
# by rows
df.sort_index()

            b    c     d     e
Colorado  6.0  8.0   7.0   NaN
Ohio      3.0  2.0   5.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  5.0  11.0   8.0
Utah      0.0  NaN   1.0   2.0

In [209]:
# by columns 
df.sort_index(axis = 'columns')

            b    c     d     e
Colorado  6.0  8.0   7.0   NaN
Ohio      3.0  2.0   5.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  5.0  11.0   8.0
Utah      0.0  NaN   1.0   2.0

In [210]:
# reverse sorting 
df.sort_index(axis = 'columns', ascending=False)

             e     d    c    b
Colorado   NaN   7.0  8.0  6.0
Ohio       5.0   5.0  2.0  3.0
Oregon    11.0  10.0  NaN  9.0
Texas      8.0  11.0  5.0  9.0
Utah       2.0   1.0  NaN  0.0

In [215]:
# sorting by values
df.sort_values('b')

            b    c     d     e
Utah      0.0  NaN   1.0   2.0
Ohio      3.0  2.0   5.0   5.0
Colorado  6.0  8.0   7.0   NaN
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  5.0  11.0   8.0

Il posizione del valore `NaN` nella lista riordinata e arbitrario. Di default viene messo in fondo.

In [212]:
obj = pd.Series(np.arange(4.))
obj.sort_values()

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [213]:
obj.iloc[1] = np.nan
obj.sort_values()

0    0.0
2    2.0
3    3.0
1    NaN
dtype: float64

In [214]:
# NaN on top
obj.sort_values(na_position='first')

1    NaN
0    0.0
2    2.0
3    3.0
dtype: float64

> **Ranking** 
>
> Asseganre un punteggio (rank) a seconda del valore del dato. Di default il rank viene assegnato in ordine di valore crescente. Nel caso di rank condiviso (spareggio) il valore assegnato corrisponde alla media dei rank che andrebbero assegnati ai valori in spareggio.

In [218]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [219]:
# breaking ties according to the order in which values are observed
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [ ]:
# descending order ranking
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

Nei `DataFrame` il *ranking* puo avvenire sia per righe che per colonne.

In [221]:
frame

          b         d         e
a  0.496714 -0.138264  0.647689
b  1.523030 -0.234153 -0.234137
c  1.579213  0.767435 -0.469474
d  0.542560 -0.463418 -0.465730

In [ ]:
# by columns
frame.rank(axis = 'columns')

     b    d    e
a  2.0  1.0  3.0
b  3.0  1.0  2.0
c  3.0  2.0  1.0
d  3.0  2.0  1.0

In [ ]:
# by rows
frame.rank(axis = 'index')

     b    d    e
a  1.0  3.0  4.0
b  3.0  2.0  3.0
c  4.0  4.0  1.0
d  2.0  1.0  2.0

## 3. Calcolo di Statistiche Descrittive

In *pandas* sono implementate molte delle statistiche descrittive fra le piu utilizzate. Il grosso vantaggio rispetto alle implementazioni di *numpy* e quello di gestire in maniera automatica i valori mancanti.

In [224]:
frame

          b         d         e
a  0.496714 -0.138264  0.647689
b  1.523030 -0.234153 -0.234137
c  1.579213  0.767435 -0.469474
d  0.542560 -0.463418 -0.465730

In [229]:
frame.loc['a', ['d','e']] = np.nan
frame

          b         d         e
a  0.496714       NaN       NaN
b  1.523030 -0.234153 -0.234137
c  1.579213  0.767435 -0.469474
d  0.542560 -0.463418 -0.465730

In [ ]:
# sum by columns
frame.sum(axis = 'columns')

a    0.496714
b    1.054740
c    1.877173
d   -0.386587
dtype: float64

In [ ]:
# mean by row
frame.mean(axis='index')

b    1.035379
d    0.023288
e   -0.389780
dtype: float64

In [ ]:
# variance of the first row
frame.iloc[1].var()

np.float64(1.0292213530004521)

In [237]:
# index of the maximum and minimum value 
frame.idxmax()

b    c
d    c
e    b
dtype: object

In [239]:
frame.idxmin()

b    a
d    d
e    c
dtype: object

In [241]:
# cumulative sum by rows 
frame.cumsum()

          b         d         e
a  0.496714       NaN       NaN
b  2.019744 -0.234153 -0.234137
c  3.598957  0.533281 -0.703611
d  4.141517  0.069864 -1.169341

In [ ]:
# wrapper method by rows
frame.describe()

              b         d         e
count  4.000000  3.000000  3.000000
mean   1.035379  0.023288 -0.389780
std    0.596263  0.654566  0.134804
min    0.496714 -0.463418 -0.469474
25%    0.531099 -0.348786 -0.467602
50%    1.032795 -0.234153 -0.465730
75%    1.537076  0.266641 -0.349933
max    1.579213  0.767435 -0.234137

In [234]:
# wrapper method by columns
frame.T.describe()

              a         b         c         d
count  1.000000  3.000000  3.000000  3.000000
mean   0.496714  0.351580  0.625724 -0.128862
std         NaN  1.014505  1.031669  0.581470
min    0.496714 -0.234153 -0.469474 -0.465730
25%    0.496714 -0.234145  0.148980 -0.464574
50%    0.496714 -0.234137  0.767435 -0.463418
75%    0.496714  0.644446  1.173324  0.039571
max    0.496714  1.523030  1.579213  0.542560

In [236]:
# wrapper method on non-numerical values
s = Series(['a', 'a', 'b', 'c']*4)
s.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Ci sono anche dei metodi che sono specifici per le `Series`.

In [255]:
obj = Series(['c', 'a', 'd']*3)
obj.unique()

array(['c', 'a', 'd'], dtype=object)

In [256]:
obj.value_counts()

c    3
a    3
d    3
Name: count, dtype: int64

E anche possibile filtrare i valori sfruttando un'implementazione vettorizzata fornita dall'API di *pandas*.

In [261]:
# masking 
mask = obj.isin(['d', 'c'])
obj[mask]

0    c
2    d
3    c
5    d
6    c
8    d
dtype: object

### Esempio Guidato

![alt text](images/stock_market.avif)

In [244]:
price = pd.read_pickle('examples/yahoo_price.pkl')
volume = pd.read_pickle('examples/yahoo_volume.pkl')

Adesso calcoliamo il *fractional change*, un'operazione sulle serie storiche che tratteremo piu avanti. Ulteriori informazioni possono essere trovate al seguente [link](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pct_change.html).

In [246]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

Formula per la covarianza: 
$$
\operatorname{Cov}(X, Y) = \sigma_{XY} = E[(X - \mu_X)(Y - \mu_Y)]
$$
$$
s_{xy} = \frac{1}{n-1} \sum_{i=1}^{n} (x_i - \bar{x})(y_i - \bar{y})
$$

In [248]:
returns['MSFT'].cov(returns['IBM'])

np.float64(8.870655479703546e-05)

In [ ]:
# by row covariance computation (covariance matrix)
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

Formula per l'indice di correlazione: 
$$
\rho_{XY} = \frac{\operatorname{Cov}(X, Y)}{\sigma_X \sigma_Y} = \frac{E[(X - \mu_X)(Y - \mu_Y)]}{\sigma_X \sigma_Y}
$$
$$
r_{xy} = \frac{s_{xy}}{s_x s_y} = \frac{\sum_{i=1}^{n} (x_i - \bar{x})(y_i - \bar{y})}{\sqrt{\sum_{i=1}^{n} (x_i - \bar{x})^2} \sqrt{\sum_{i=1}^{n} (y_i - \bar{y})^2}}
$$

In [247]:
returns['MSFT'].corr(returns['IBM'])

np.float64(0.49976361144151144)

In [ ]:
# correlation matrix
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [253]:
# correlation wrt to a specific attribute
returns.corrwith(returns['IBM'])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [ ]:
# correlation wrt a dataframe: computes the correlation of matching column names 
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

### Imputazione

In *pandas* il processo di imputazione e molto semplice.

In [270]:
frame

          b         d         e
a  0.496714       NaN       NaN
b  1.523030 -0.234153 -0.234137
c  1.579213  0.767435 -0.469474
d  0.542560 -0.463418 -0.465730

In [272]:
frame.fillna(0)

          b         d         e
a  0.496714  0.000000  0.000000
b  1.523030 -0.234153 -0.234137
c  1.579213  0.767435 -0.469474
d  0.542560 -0.463418 -0.465730

In [271]:
imputed_frame = frame.replace(np.nan, 0)
imputed_frame

          b         d         e
a  0.496714  0.000000  0.000000
b  1.523030 -0.234153 -0.234137
c  1.579213  0.767435 -0.469474
d  0.542560 -0.463418 -0.465730

# Esercizi

## 1\. Oggetti: Series e DataFrame

Questa sezione copre la creazione e la manipolazione di base degli oggetti `Series` e `DataFrame`.

###  Domande di Teoria

1.  Qual  la differenza principale tra un oggetto `Series` e un oggetto `DataFrame`?
2.  Quando si crea una `Series` da un dizionario Python, cosa utilizza Pandas per l'indice e cosa per i valori?
3.  Cosa succede se si sommano due `Series` che non hanno indici perfettamente allineati (ad esempio, una ha indici `['a', 'b']` e l'altra `['b', 'c']`)?
4.  Qual  la differenza tra accedere a una colonna di un `DataFrame` con `df['colonna']` e accedere a una riga con `df.loc[etichetta_riga]`?

###  Esercizi di Programmazione

**Esercizio 1.1: Creare una Series da un dizionario**

Crea una `Series` chiamata `popolazione_citta` utilizzando il seguente dizionario. Assegna alla `Series` il nome (attributo `.name`) "Popolazione" e al suo indice il nome (attributo `.index.name`) "Citt".

```python
dati_citta = {'Milano': 1_350_000, 'Roma': 2_870_000, 'Napoli': 960_000}
```

**Esercizio 1.2: Selezionare dati da una Series**

Data la `Series` creata nell'esercizio 1.1, esegui le seguenti operazioni:

1.  Seleziona la popolazione di 'Roma'.
2.  Seleziona la popolazione di 'Milano' e 'Napoli' in un'unica operazione.
3.  Mostra tutte le citt con una popolazione superiore a 1.000.000.

**Esercizio 1.3: Creare un DataFrame**

Crea un `DataFrame` chiamato `studenti_df` partendo dal seguente dizionario.

```python
dati_studenti = {
    'Nome': ['Alice', 'Bruno', 'Chiara', 'Davide'],
    'Esame': ['Statistica', 'Python', 'Statistica', 'Python'],
    'Voto': [28, 30, 25, 27]
}
```

**Esercizio 1.4: Accedere e modificare un DataFrame**

Usando lo `studenti_df` dell'esercizio 1.3:

1.  Mostra solo le prime due righe del `DataFrame`.
2.  Seleziona solo la colonna 'Voto'.
3.  Seleziona la riga all'indice `1` (quella di Bruno) usando `.loc[]`.
4.  Seleziona la riga all'indice `1` (quella di Bruno) usando `.iloc[]`.
5.  Aggiungi una nuova colonna chiamata 'Lode' e impostala su `False` per tutti gli studenti.
6.  Modifica il voto di 'Chiara' (indice `2`) da 25 a 26.
7.  Elimina la colonna 'Esame' dal `DataFrame`.

###  Soluzioni

In [ ]:
import numpy as np
import pandas as pd
# Soluzione 1.1
dati_citta = {'Milano': 1_350_000, 'Roma': 2_870_000, 'Napoli': 960_000}
popolazione_citta = pd.Series(dati_citta)
popolazione_citta.name = 'Popolazione'
popolazione_citta.index.name = 'Citt'
print("--- Soluzione 1.1 ---")
print(popolazione_citta)
print("\n")

# Soluzione 1.2
print("--- Soluzione 1.2 ---")
# 1. Popolazione di Roma
print(f"Popolazione Roma: {popolazione_citta['Roma']}")
# 2. Popolazione di Milano e Napoli
print("Popolazione Milano e Napoli:")
print(popolazione_citta[['Milano', 'Napoli']])
# 3. Popolazione > 1 milione
print("Citt > 1 milione:")
print(popolazione_citta[popolazione_citta > 1_000_000])
print("\n")

# Soluzione 1.3
dati_studenti = {
    'Nome': ['Alice', 'Bruno', 'Chiara', 'Davide'],
    'Esame': ['Statistica', 'Python', 'Statistica', 'Python'],
    'Voto': [28, 30, 25, 27]
}
studenti_df = pd.DataFrame(dati_studenti)
print("--- Soluzione 1.3 ---")
print(studenti_df)
print("\n")

# Soluzione 1.4
print("--- Soluzione 1.4 ---")
# 1. Prime due righe
print("1. Head(2):")
print(studenti_df.head(2))
# 2. Colonna 'Voto'
print("\n2. Colonna 'Voto':")
print(studenti_df['Voto'])
# 3. Riga 1 con .loc
print("\n3. Riga 1 con .loc:")
print(studenti_df.loc[1])
# 4. Riga 1 con .iloc
print("\n4. Riga 1 con .iloc:")
print(studenti_df.iloc[1])
# 5. Aggiungi colonna 'Lode'
studenti_df['Lode'] = False
print("\n5. Aggiunta colonna 'Lode':")
print(studenti_df)
# 6. Modifica voto Chiara
studenti_df.loc[2, 'Voto'] = 26
print("\n6. Modifica voto Chiara:")
print(studenti_df)
# 7. Elimina colonna 'Esame'
del studenti_df['Esame']
print("\n7. Eliminata colonna 'Esame':")
print(studenti_df)

## 2\. Funzioni Fondamentali di Pandas

Questa sezione copre re-indicizzazione, rimozione di dati, accesso avanzato e operazioni.

###  Domande di Teoria

1.  A cosa serve il metodo `.reindex()`? Cosa fa l'argomento `method='ffill'`?
2.  Per eliminare una colonna da un `DataFrame`, quale sintassi preferisci tra `del df['nome_colonna']` e `df.drop(columns=['nome_colonna'])`? C' una differenza nel risultato? (Suggerimento: uno modifica l'originale, l'altro crea una copia).
3.  Qual  la differenza tra `.apply()` e `.map()`? (Suggerimento: uno opera su righe/colonne, l'altro elemento per elemento).
4.  Cosa fa `.sort_values()` e come si differenzia da `.sort_index()`?
5.  Quando si usa `.rank()`, cosa significa `method='average'` (che  il default) se ci sono valori duplicati?

###  Esercizi di Programmazione

**Esercizio 2.1: Reindexing con fill**

Data la seguente `Series` che rappresenta le vendite in giorni alterni:

```python
vendite = pd.Series([10, 15, 12], index=[0, 2, 4])
```

1.  Re-indicizzala per coprire tutti i giorni da 0 a 5 (`[0, 1, 2, 3, 4, 5]`).
2.  Esegui di nuovo il re-indexing, ma questa volta riempi i valori mancanti portandoti dietro l'ultimo valore valido (forward-fill).

**Esercizio 2.2: Drop di righe e colonne**

Riprendi lo `studenti_df` dell'esercizio 1.3 (ricrealo se necessario).

1.  Crea un nuovo `DataFrame` `df_no_voto` eliminando la colonna 'Voto' utilizzando il metodo `.drop()`.
2.  Crea un nuovo `DataFrame` `df_no_bruno` eliminando la riga all'indice `1` (Bruno) usando il metodo `.drop()`.

**Esercizio 2.3: Selezione avanzata con .loc**

Riprendi lo `studenti_df` dell'esercizio 1.3.

1.  Seleziona tutti gli studenti che hanno sostenuto l'esame 'Python'.
2.  Seleziona solo il 'Nome' e il 'Voto' degli studenti che hanno preso un voto maggiore di 27.

**Esercizio 2.4: Sorting e Ranking**

Riprendi lo `studenti_df` dell'esercizio 1.3.

1.  Ordina il `DataFrame` in base al 'Voto', dal pi alto al pi basso.
2.  Aggiungi una colonna 'Rank' che contenga il ranking (la "classifica") degli studenti in base al loro voto (il voto pi alto deve avere il rank 1).

**Esercizio 2.5: Operazioni con .apply()**

Riprendi lo `studenti_df` dell'esercizio 1.3. Vogliamo aggiungere una colonna 'Status'.

1.  Definisci una funzione Python `definisci_status(voto)` che restituisca "Promosso" se il voto  \>= 24 e "Bocciato" altrimenti.
2.  Usa il metodo `.apply()` (o `.map()`) sulla colonna 'Voto' per creare la nuova colonna 'Status' applicando la tua funzione.

###  Soluzioni

In [ ]:
import pandas as pd
import numpy as np

# Soluzione 2.1
vendite = pd.Series([10, 15, 12], index=[0, 2, 4])
nuovo_indice = [0, 1, 2, 3, 4, 5]
print("--- Soluzione 2.1 ---")
# 1. Reindex semplice (con NaN)
print("1. Reindex con NaN:")
print(vendite.reindex(nuovo_indice))
# 2. Reindex con ffill
print("\n2. Reindex con 'ffill':")
print(vendite.reindex(nuovo_indice, method='ffill'))
print("\n")

# Soluzione 2.2
# Ricreo il df
dati_studenti = {
    'Nome': ['Alice', 'Bruno', 'Chiara', 'Davide'],
    'Esame': ['Statistica', 'Python', 'Statistica', 'Python'],
    'Voto': [28, 30, 25, 27]
}
studenti_df = pd.DataFrame(dati_studenti)
print("--- Soluzione 2.2 ---")
# 1. Drop colonna 'Voto'
df_no_voto = studenti_df.drop(columns=['Voto'])
print("1. Senza colonna 'Voto':")
print(df_no_voto)
# 2. Drop riga 1 (Bruno)
df_no_bruno = studenti_df.drop(index=1)
print("\n2. Senza riga 1 (Bruno):")
print(df_no_bruno)
print("\n")

# Soluzione 2.3
print("--- Soluzione 2.3 ---")
# 1. Studenti di Python
studenti_python = studenti_df.loc[studenti_df['Esame'] == 'Python']
print("1. Studenti di Python:")
print(studenti_python)
# 2. Nomi e Voti > 27
studenti_top = studenti_df.loc[studenti_df['Voto'] > 27, ['Nome', 'Voto']]
print("\n2. Studenti con Voto > 27 (Nome, Voto):")
print(studenti_top)
print("\n")

# Soluzione 2.4
print("--- Soluzione 2.4 ---")
# 1. Sort by Voto (descending)
df_sorted = studenti_df.sort_values(by='Voto', ascending=False)
print("1. DataFrame ordinato per Voto (desc):")
print(df_sorted)
# 2. Aggiungi Rank
studenti_df['Rank'] = studenti_df['Voto'].rank(ascending=False)
print("\n2. DataFrame con Rank:")
print(studenti_df)
print("\n")

# Soluzione 2.5
print("--- Soluzione 2.5 ---")
# 1. Funzione
def definisci_status(voto):
    if voto >= 24:
        return 'Promosso'
    else:
        return 'Bocciato'

# 2. Apply/Map
studenti_df['Status'] = studenti_df['Voto'].apply(definisci_status)
# NOTA: .map()  spesso preferito per una singola Series
# studenti_df['Status'] = studenti_df['Voto'].map(definisci_status)
print("DataFrame con colonna 'Status':")
print(studenti_df)

## 3\. Statistiche Descrittive e Imputazione

Questa sezione copre i metodi per riassumere i dati e gestire i valori mancanti.

###  Domande di Teoria

1.  Il metodo `.sum()` su un `DataFrame` somma di default per riga o per colonna? Come si cambia questo comportamento?
2.  Cosa fa `.idxmax()`? Restituisce il valore massimo o l'indice del valore massimo?
3.  Quando usi `.describe()` su un `DataFrame` che contiene sia colonne numeriche che colonne di testo (object), cosa succede?
4.  Spiega la differenza tra `.unique()` e `.value_counts()` su una `Series`.
5.  Qual  la differenza tra `df.fillna(0)` e `df.dropna()`?

###  Esercizi di Programmazione

**Esercizio 3.1: Statistiche di base**

Riprendi lo `studenti_df` dell'esercizio 1.3.

1.  Calcola il voto medio (metodo `.mean()`) della classe.
2.  Trova il nome dello studente (o gli studenti) con il voto pi alto (usa `.idxmax()` sul 'Voto' e poi seleziona il nome).
3.  Calcola la somma ( `.sum()`) di tutti i voti.

**Esercizio 3.2: .describe()**

Esegui `.describe()` sullo `studenti_df` dell'esercizio 1.3. Esegui `.describe()` anche sulla colonna 'Esame'. Cosa noti di diverso nell'output?

**Esercizio 3.3: Dati categoriali (.value\_counts() e .isin())**

Riprendi lo `studenti_df` dell'esercizio 1.3.

1.  Quanti studenti hanno sostenuto l'esame 'Python' e quanti 'Statistica'? (Usa `.value_counts()`).
2.  Seleziona tutte le righe del `DataFrame` relative solo agli studenti 'Alice' e 'Davide' (usa `.isin()` sulla colonna 'Nome').

**Esercizio 3.4: Gestione dei NaN (Imputazione)**

Crea il seguente `DataFrame` che contiene dei valori mancanti:

```python
dati_nan = {
    'Prodotto': ['A', 'B', 'A', 'C', 'B'],
    'Vendite': [100, 150, np.nan, 200, 150],
    'Resi': [10, np.nan, 5, np.nan, 8]
}
df_nan = pd.DataFrame(dati_nan)
```

1.  Verifica quanti valori `NaN` ci sono in ogni colonna.
2.  Crea un nuovo `DataFrame` `df_imputed` dove tutti i `NaN` sono stati sostituiti con il valore `0` (usa `.fillna()`).
3.  Crea un nuovo `DataFrame` `df_dropped` dove tutte le righe che contengono *almeno un* `NaN` sono state eliminate (usa `.dropna()`).

###  Soluzioni

In [ ]:
import pandas as pd
import numpy as np

# Ricreo il df
dati_studenti = {
    'Nome': ['Alice', 'Bruno', 'Chiara', 'Davide'],
    'Esame': ['Statistica', 'Python', 'Statistica', 'Python'],
    'Voto': [28, 30, 25, 27]
}
studenti_df = pd.DataFrame(dati_studenti)

print("--- Soluzione 3.1 ---")
# 1. Voto medio
media_voti = studenti_df['Voto'].mean()
print(f"1. Voto medio: {media_voti}")
# 2. Studente con voto pi alto
idx_max = studenti_df['Voto'].idxmax()
studente_top = studenti_df.loc[idx_max, 'Nome']
print(f"2. Studente con voto pi alto: {studente_top}")
# 3. Somma voti
somma_voti = studenti_df['Voto'].sum()
print(f"3. Somma totale voti: {somma_voti}")
print("\n")

print("--- Soluzione 3.2 ---")
# 1. Describe sul DataFrame (mostra solo 'Voto')
print("1. .describe() sul DataFrame:")
print(studenti_df.describe())
# 2. Describe sulla colonna 'Esame' (mostra statistiche per 'object')
print("\n2. .describe() sulla colonna 'Esame':")
print(studenti_df['Esame'].describe())
print("\n")

print("--- Soluzione 3.3 ---")
# 1. Value counts
print("1. Conteggio esami:")
print(studenti_df['Esame'].value_counts())
# 2. Filtro con .isin()
studenti_selezionati = studenti_df[studenti_df['Nome'].isin(['Alice', 'Davide'])]
print("\n2. Seleziona solo Alice e Davide:")
print(studenti_selezionati)
print("\n")

print("--- Soluzione 3.4 ---")
dati_nan = {
    'Prodotto': ['A', 'B', 'A', 'C', 'B'],
    'Vendite': [100, 150, np.nan, 200, 150],
    'Resi': [10, np.nan, 5, np.nan, 8]
}
df_nan = pd.DataFrame(dati_nan)
print("DataFrame originale con NaN:")
print(df_nan)
# 1. Contare i NaN
print("\n1. Conteggio NaN per colonna:")
print(df_nan.isna().sum())
# 2. Sostituire NaN con 0 (.fillna)
df_imputed = df_nan.fillna(0)
print("\n2. DataFrame con .fillna(0):")
print(df_imputed)
# 3. Eliminare righe con NaN (.dropna)
df_dropped = df_nan.dropna()
print("\n3. DataFrame con .dropna():")
print(df_dropped)

## 4\. Esercizi sull'Analisi Dati (Correlazione)

Questa sezione si basa sull'esempio guidato relativo ai dati finanziari.

###  Domande di Teoria

1.  Cosa calcola il metodo `.pct_change()`? Perch  utile nell'analisi finanziaria?
2.  Spiega la differenza tra Covarianza (calcolata con `.cov()`) e Correlazione (calcolata con `.corr()`).
3.  Quando si calcola `returns.corr()`, che tipo di struttura dati si ottiene? Cosa rappresenta il valore sulla diagonale di questa struttura?

###  Esercizi di Programmazione

**Esercizio 4.1: Calcolo Correlazione**

Dati i seguenti `DataFrame` che rappresentano i prezzi di chiusura di due Azioni e i volumi di scambio:

```python
prezzi = pd.DataFrame({
    'AZIONE_X': [100, 102, 101, 103, 105],
    'AZIONE_Y': [50, 51, 52, 52, 53]
})

volumi = pd.DataFrame({
    'AZIONE_X': [1000, 1200, 800, 900, 1100],
    'AZIONE_Y': [500, 600, 700, 550, 650]
})
```

1.  Calcola i rendimenti giornalieri (i "returns") per il `DataFrame` `prezzi` usando `.pct_change()`. Chiama il risultato `returns_df`.
2.  Calcola la matrice di correlazione ($\rho_{XY}$) sui rendimenti (`returns_df`). C' una correlazione forte tra X e Y?
3.  Calcola la correlazione tra i rendimenti di 'AZIONE\_X' (`returns_df['AZIONE_X']`) e i volumi di 'AZIONE\_X' (`volumi['AZIONE_X']`). (Usa `returns_df['AZIONE_X'].corr(volumi['AZIONE_X'])`).

###  Soluzioni

In [ ]:
import pandas as pd
import numpy as np

prezzi = pd.DataFrame({
    'AZIONE_X': [100, 102, 101, 103, 105],
    'AZIONE_Y': [50, 51, 52, 52, 53]
})

volumi = pd.DataFrame({
    'AZIONE_X': [1000, 1200, 800, 900, 1100],
    'AZIONE_Y': [500, 600, 700, 550, 650]
})

print("--- Soluzione 4.1 ---")
# 1. Calcola i rendimenti (returns)
returns_df = prezzi.pct_change()
print("1. Rendimenti (pct_change):")
print(returns_df)

# 2. Matrice di correlazione
correlation_matrix = returns_df.corr()
print("\n2. Matrice di Correlazione sui rendimenti:")
print(correlation_matrix)
print("(S, la correlazione di 0.81  considerata forte e positiva)")

# 3. Correlazione tra rendimenti e volumi
corr_returns_volume_X = returns_df['AZIONE_X'].corr(volumi['AZIONE_X'])
print(f"\n3. Correlazione tra Rendimenti X e Volumi X: {corr_returns_volume_X}")
print("(Una correlazione negativa debole)")